InterviewPreparationBackend.tex
% Created 2021-05-21 Fri 21:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abul Kalam Robin}
\date{\today}
\title{Interview Preparation Backend}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Preparation Backend},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{JavaScript Coding Questions}
\label{sec:org99e51b5}
\begin{enumerate}
\item Explain what a callback function is and provide a simple example.
\item Given a string, reverse each word in the sentence.
\item How to check if an object is an array or not? provide code.
\item How to empty an array in JavaScript?
\item How would you check if a number is an integer?
\item Implement enqueue and dequeue using only two stacks?
\item Make this work
\begin{verbatim}
duplicate([1,2,3,4,5]); // [1,2,3,4,5,1,2,3,4,5]
console.log("hello");
\end{verbatim}

\item Write a ``mul'' function which will properly when invoked as below syntax
\begin{verbatim}
console.log(mul(2)(3)(4)); // output: 24
console.log(mul(4)(3)(4)); // output: 48
\end{verbatim}

\item Write a function that would allow you to do this
\begin{verbatim}
var addSix = createBase(6);
addSix(10); // returns 16
addSix(21); // returns 27
\end{verbatim}

\item Fizzbuzz challenge: Create a for loop that iterates up to 100 while outputting ``fizz'' at multiples of 3, ``buzz'' at multiples of 5 and ``fizzbuzz'' at multiples of 3 and 5.

\item Given two strings, return true if they are anagrams of one another.
\item How would you use a closure to create a private counter?
\item What would be the following code output?
\begin{verbatim}
(function(){
  var a = b = 5;
})();

console.log(b);
\end{verbatim}

\item How this keyword works? Provide some example.
\item Write a function that would allow you to do this
\begin{verbatim}
multiply(5)(6);
\end{verbatim}
\end{enumerate}
\end{document}
